#include <stdio.h>

int main(){
    char a, result;
    // 입력한 문자를 저장할 변수 a와 a에 증가한 결과 문자를 저장할 변수 result를 선언
    int add;
    // 얼마큼 증가할 것인지에 대한 숫자를 입력받을 변수 add 선언
    scanf("%c %d", &a, &add);
    // 초기 문자와 증가시킬 숫자입력
    
    
    if('a'<= a && a <= 'z'){
        // 만약 초기문자가 소문자라면 소문자로 출력되기 위해 조건문 사용.
        result = a + add;
        // 결과 값에 초기문자에 단순히 증감시킬 숫자를 더함.
        if(result > 'z'){
            // 만약 결과값이 z를 벗어나면
            a += add - 'a';
            // 증가시킬 숫자에 결과값에 'z'나누나누고 알파벳개수또한 초과한다면 다시 mod26해주어 초과한 숫자를 다시 저장.
            printf("%c", a &26 + 'a');
            result = 'a' + add;
            // 재저장한 'a'에 add를 더하고 'a'에 더하므로 -1
        }
        // else if(result < 'a'){
        //     // 만약 결과값이 'a'를 벗어나면
        //     add = ('a' - result) % 26;
        //     // 'a'와 결과값의 차액을 다시 add에 저장
        //     result = 'z' - add + 1; 
        //     // 결과값에 새로운 add를 뺌 'z'에서 빼므로 +1
        // }
    }
    else if('A'<= a && a <= 'Z'){
        // 만약 초기문자가 대문자라면 대문자로 출력되기 위해 조건문 사용.
        result = a + add;
        // 결과 값에 초기문자에 단순히 증가시킬 숫자를 더함.
        if(result > 'Z'){
            // 만약 결과값이 알파벳을 벗어난다면
            add = (result - 'Z' - 1) % 26;
            // 증가시킬 숫자에 결과값에 'Z'나누고 알파벳개수또한 초과한다면 다시 mod26해주어 초과한 숫자를 다시 저장.
            result = 'A' + add;
            // 재저장한 'A'에 add를 더하고 'A'에 더하므로 -1
        }
        // else if(result < 'A'){
        //     // 만약 결과값이 'A'를 벗어나면
        //     add = ('A' - result) % 26;
        //     // 'A'와 결과값의 차액을 다시 add에 저장
        //     result = 'Z' - add + 1; 
        //     // 결과값에 새로운 add를 뺌 'Z'에서 빼므로 +1
        // }
    }
    else{
        // 알파벳이 아닌경우 더하지 않고 그대로 결과에 저장.
        result = a;
    }
    

    printf("%c", result);
    //결과값 출력

    return 0;
}