#include <stdio.h>

int main(){
    char a, result; // 입력한 문자를 저장할 변수 a와 a에 증가한 결과 문자를 저장할 변수 result를 선언
    int add;    // // 얼마큼 증가할 것인지에 대한 숫자를 입력받을 변수 add 선언

    scanf("%c %d", &a, &add); // 초기 문자와 증가시킬 숫자입력
    
    if ('a' <= a && a <= 'z'){ // 만약 초기문자가 소문자라면
        add %= 26;  // 증가할 숫자를 mod 26을 하여 저장. 알파벳 개수가 26개이기 떄문.
        result = a + add; // 결과값에 초기 문자에 저장한 더할 숫자를 더함
        if (result > 'z' || result < 'a'){ // 저장한 결과값이 소문자의 범위에 해당하지 않는 경우
            add = result - 'z' ;    //  벗어난 값의 차이를 증가시킬 숫자에 다시 저장
            result = 'a' + add - 1; // 결과에 그 차이를 'a'에 더해 -1한 값을 재 저장. 'a'에 저장 하므로 중복 되기에 -1을 함.
        }
        printf("%c", result);  // 결과 출력
    }
    else if ('A' <= a && a <= 'Z'){     // 만약 초기문자가 대문자라면
        add %= 26;      // 증가할 숫자를 mod 26을 하여 저장. 알파벳 개수가 26개이기 떄문.
        result = a + add;   // 결과값에 초기 문자에 저장한 더할 숫자를 더함
        if (result > 'Z' || result < 'A'){  // 저장한 결과값이 소문자의 범위에 해당하지 않는 경우
            add = result - 'Z' ;        //  벗어난 값의 차이를 증가시킬 숫자에 다시 저장
            result = 'A' + add - 1;     // 결과에 그 차이를 'A'에 더해 -1한 값을 재 저장. 'A'에 더한 값을 저장 하므로 중복 되기에 -1을 함.

        }
        printf("%c", result);  // 결과 출력
    }
    else{
        result = a; // 알파벳이 아닌경우 더하지 않고 그대로 결과에 저장.
        printf("%c", result);   // 결과 출력
    }

    return 0;
}