#include <stdio.h>

int main(){
    char a;     // 초기 문자를 입력 받을 변수 선언
    int add;    // 더할 만큼의 수를 입력 받을 변수 선언
    scanf("%c %d", &a, &add);   // 초기문자, 더할 만큼의 수 입력
    if('a' <= a && a <= 'z'){   // 초기 문자가 소문자인 경우
        a += add - 'a';         // 초기 문자를 저장한 변수 a에 더한 만큼과 'a'와의 차이를 다시 저장
        printf("%c", a%26 + 'a');   // 재저장한 a가 알파벳의 개수를 벗어나지 않도로 mod 26을 해주고 'a'에 더하여 출력
    }
    else if('A' <= a && a <= 'Z'){  // 초기 문자가 대문자인 경우
        a += add - 'A';             // 초기 문자를 저장한 변수 a에 더한 만큼과 'A'와의 차이를 다시 저장
        printf("%c", a%26 + 'A');   // 재저장한 a가 알파벳의 개수를 벗어나지 않도로 mod 26을 해주고 'A'에 더하여 출력
    }
    else{                      // 알파벳이 아닌경우
        printf("%c", a);       // 초기 문자를 그대로 출력.
    }

    return 0;
}